/*
    Функция должна принимать в качестве аргумента массив чисел и возвращать так
    же массив, но отсортированный по возрастанию. Системные функции сортировки не
    использовать.

    Пример: В функцию передали [1, 22, 5, 66, 3, 57]. Вернула: [1, 3, 5, 22, 57, 66]

    Дополнительно (не обязательно): Доработать функцию так, чтобы в качестве
    второго аргумента она принимала название функции сортировки. И сортировала
    массив с использованием этой функции. В идеале добавить 2 функции сортировки,
    одна из которых должна быть задана по умолчанию.
*/