/*
    Функция должна принимать 2 параметра:
        а) массив чисел;
        б) строку, обозначающую арифметическое действие,
           которое нужно выполнить со всеми элементами массива.
    Функция должна вывести результат.

    Например: имя функции someFunction(array(1,2,3,4), ‘ – ’);
    Результат: 1 – 2 – 3 – 4 = 8

    Дополнительно (не обязательно): Написать все, на Ваш взгляд, требуемые
    проверки. Сделать по умолчанию любую арифметическую операцию. И сделать
    возможность приём не только одного арифметического действия, но и массив
    действий. И сколько заданных действий будет, столько и должно быть выведено
    результатов.
*/